grevaillot/svd_tools/headers/STM32H750x/dmamux2.h
#pragma once 

/* --- DMAMUX2: DMAMUX ---------------------------------------------- */

/** @defgroup dmamux2_registers DMAMUX Register
@{*/

/** DMAMUX2_DMAMUX2_C0CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX2_DMAMUX2_C0CR			MMIO32(DMAMUX2_BASE + 0x00)
/** DMAMUX2_DMAMUX2_C1CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX2_DMAMUX2_C1CR			MMIO32(DMAMUX2_BASE + 0x04)
/** DMAMUX2_DMAMUX2_C2CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX2_DMAMUX2_C2CR			MMIO32(DMAMUX2_BASE + 0x08)
/** DMAMUX2_DMAMUX2_C3CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX2_DMAMUX2_C3CR			MMIO32(DMAMUX2_BASE + 0x0c)
/** DMAMUX2_DMAMUX2_C4CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX2_DMAMUX2_C4CR			MMIO32(DMAMUX2_BASE + 0x10)
/** DMAMUX2_DMAMUX2_C5CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX2_DMAMUX2_C5CR			MMIO32(DMAMUX2_BASE + 0x14)
/** DMAMUX2_DMAMUX2_C6CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX2_DMAMUX2_C6CR			MMIO32(DMAMUX2_BASE + 0x18)
/** DMAMUX2_DMAMUX2_C7CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX2_DMAMUX2_C7CR			MMIO32(DMAMUX2_BASE + 0x1c)
/** DMAMUX2_DMAMUX2_CSR DMAMUX request line multiplexer interrupt channel status register **/
#define DMAMUX2_DMAMUX2_CSR			MMIO32(DMAMUX2_BASE + 0x80)
/** DMAMUX2_DMAMUX2_CFR DMAMUX request line multiplexer interrupt clear flag register **/
#define DMAMUX2_DMAMUX2_CFR			MMIO32(DMAMUX2_BASE + 0x84)
/** DMAMUX2_DMAMUX2_RG0CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX2_DMAMUX2_RG0CR			MMIO32(DMAMUX2_BASE + 0x100)
/** DMAMUX2_DMAMUX2_RG1CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX2_DMAMUX2_RG1CR			MMIO32(DMAMUX2_BASE + 0x104)
/** DMAMUX2_DMAMUX2_RG2CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX2_DMAMUX2_RG2CR			MMIO32(DMAMUX2_BASE + 0x108)
/** DMAMUX2_DMAMUX2_RG3CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX2_DMAMUX2_RG3CR			MMIO32(DMAMUX2_BASE + 0x10c)
/** DMAMUX2_DMAMUX2_RG4CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX2_DMAMUX2_RG4CR			MMIO32(DMAMUX2_BASE + 0x110)
/** DMAMUX2_DMAMUX2_RG5CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX2_DMAMUX2_RG5CR			MMIO32(DMAMUX2_BASE + 0x114)
/** DMAMUX2_DMAMUX2_RG6CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX2_DMAMUX2_RG6CR			MMIO32(DMAMUX2_BASE + 0x118)
/** DMAMUX2_DMAMUX2_RG7CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX2_DMAMUX2_RG7CR			MMIO32(DMAMUX2_BASE + 0x11c)
/** DMAMUX2_DMAMUX2_RGSR DMAMux - DMA request generator status register **/
#define DMAMUX2_DMAMUX2_RGSR			MMIO32(DMAMUX2_BASE + 0x140)
/** DMAMUX2_DMAMUX2_RGCFR DMAMux - DMA request generator clear flag register **/
#define DMAMUX2_DMAMUX2_RGCFR			MMIO32(DMAMUX2_BASE + 0x144)

/**@}*/


/** @defgroup dmamux2_dmamux2_c0cr DMAMUX2C0CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX2_DMAMUX2_C0CR_SYNC_ID_SHIFT		24
#define DMAMUX2_DMAMUX2_C0CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux2_dmamux2_c0cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX2_DMAMUX2_C0CR_NBREQ_SHIFT		19
#define DMAMUX2_DMAMUX2_C0CR_NBREQ_MASK		0x1f
/** @defgroup dmamux2_dmamux2_c0cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX2_DMAMUX2_C0CR_SPOL_SHIFT		17
#define DMAMUX2_DMAMUX2_C0CR_SPOL_MASK		0x03
/** @defgroup dmamux2_dmamux2_c0cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX2_DMAMUX2_C0CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX2_DMAMUX2_C0CR_SE		(1 << 16)
/** DMAMUX2_DMAMUX2_C0CR_EGE Event generation enable/disable **/
#define DMAMUX2_DMAMUX2_C0CR_EGE		(1 << 9)
/** DMAMUX2_DMAMUX2_C0CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX2_DMAMUX2_C0CR_SOIE		(1 << 8)

#define DMAMUX2_DMAMUX2_C0CR_DMAREQ_ID_SHIFT		0
#define DMAMUX2_DMAMUX2_C0CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux2_dmamux2_c0cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_dmamux2_c1cr DMAMUX2C1CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX2_DMAMUX2_C1CR_SYNC_ID_SHIFT		24
#define DMAMUX2_DMAMUX2_C1CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux2_dmamux2_c1cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX2_DMAMUX2_C1CR_NBREQ_SHIFT		19
#define DMAMUX2_DMAMUX2_C1CR_NBREQ_MASK		0x1f
/** @defgroup dmamux2_dmamux2_c1cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX2_DMAMUX2_C1CR_SPOL_SHIFT		17
#define DMAMUX2_DMAMUX2_C1CR_SPOL_MASK		0x03
/** @defgroup dmamux2_dmamux2_c1cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX2_DMAMUX2_C1CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX2_DMAMUX2_C1CR_SE		(1 << 16)
/** DMAMUX2_DMAMUX2_C1CR_EGE Event generation enable/disable **/
#define DMAMUX2_DMAMUX2_C1CR_EGE		(1 << 9)
/** DMAMUX2_DMAMUX2_C1CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX2_DMAMUX2_C1CR_SOIE		(1 << 8)

#define DMAMUX2_DMAMUX2_C1CR_DMAREQ_ID_SHIFT		0
#define DMAMUX2_DMAMUX2_C1CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux2_dmamux2_c1cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_dmamux2_c2cr DMAMUX2C2CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX2_DMAMUX2_C2CR_SYNC_ID_SHIFT		24
#define DMAMUX2_DMAMUX2_C2CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux2_dmamux2_c2cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX2_DMAMUX2_C2CR_NBREQ_SHIFT		19
#define DMAMUX2_DMAMUX2_C2CR_NBREQ_MASK		0x1f
/** @defgroup dmamux2_dmamux2_c2cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


