grevaillot/svd_tools/headers/STM32H750x/dmamux2.h
/** @defgroup dmamux2_dmamux2_c7cr DMAMUX2C7CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX2_DMAMUX2_C7CR_SYNC_ID_SHIFT		24
#define DMAMUX2_DMAMUX2_C7CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux2_dmamux2_c7cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX2_DMAMUX2_C7CR_NBREQ_SHIFT		19
#define DMAMUX2_DMAMUX2_C7CR_NBREQ_MASK		0x1f
/** @defgroup dmamux2_dmamux2_c7cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX2_DMAMUX2_C7CR_SPOL_SHIFT		17
#define DMAMUX2_DMAMUX2_C7CR_SPOL_MASK		0x03
/** @defgroup dmamux2_dmamux2_c7cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX2_DMAMUX2_C7CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX2_DMAMUX2_C7CR_SE		(1 << 16)
/** DMAMUX2_DMAMUX2_C7CR_EGE Event generation enable/disable **/
#define DMAMUX2_DMAMUX2_C7CR_EGE		(1 << 9)
/** DMAMUX2_DMAMUX2_C7CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX2_DMAMUX2_C7CR_SOIE		(1 << 8)

#define DMAMUX2_DMAMUX2_C7CR_DMAREQ_ID_SHIFT		0
#define DMAMUX2_DMAMUX2_C7CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux2_dmamux2_c7cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_dmamux2_csr DMAMUX2CSR DMAMUX request line multiplexer interrupt channel status register
@{*/


#define DMAMUX2_DMAMUX2_CSR_SOF_SHIFT		0
#define DMAMUX2_DMAMUX2_CSR_SOF_MASK		0xffff
/** @defgroup dmamux2_dmamux2_csr_sof SOF Synchronization overrun event flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_dmamux2_cfr DMAMUX2CFR DMAMUX request line multiplexer interrupt clear flag register
@{*/


#define DMAMUX2_DMAMUX2_CFR_CSOF_SHIFT		0
#define DMAMUX2_DMAMUX2_CFR_CSOF_MASK		0xffff
/** @defgroup dmamux2_dmamux2_cfr_csof CSOF Clear synchronization overrun event flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_dmamux2_rg0cr DMAMUX2RG0CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX2_DMAMUX2_RG0CR_GNBREQ_SHIFT		19
#define DMAMUX2_DMAMUX2_RG0CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux2_dmamux2_rg0cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX2_DMAMUX2_RG0CR_GPOL_SHIFT		17
#define DMAMUX2_DMAMUX2_RG0CR_GPOL_MASK		0x03
/** @defgroup dmamux2_dmamux2_rg0cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX2_DMAMUX2_RG0CR_GE DMA request generator channel enable/disable **/
#define DMAMUX2_DMAMUX2_RG0CR_GE		(1 << 16)
/** DMAMUX2_DMAMUX2_RG0CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX2_DMAMUX2_RG0CR_OIE		(1 << 8)

#define DMAMUX2_DMAMUX2_RG0CR_SIG_ID_SHIFT		0
#define DMAMUX2_DMAMUX2_RG0CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux2_dmamux2_rg0cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_dmamux2_rg1cr DMAMUX2RG1CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX2_DMAMUX2_RG1CR_GNBREQ_SHIFT		19
#define DMAMUX2_DMAMUX2_RG1CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux2_dmamux2_rg1cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX2_DMAMUX2_RG1CR_GPOL_SHIFT		17
#define DMAMUX2_DMAMUX2_RG1CR_GPOL_MASK		0x03
/** @defgroup dmamux2_dmamux2_rg1cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX2_DMAMUX2_RG1CR_GE DMA request generator channel enable/disable **/
#define DMAMUX2_DMAMUX2_RG1CR_GE		(1 << 16)
/** DMAMUX2_DMAMUX2_RG1CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX2_DMAMUX2_RG1CR_OIE		(1 << 8)

#define DMAMUX2_DMAMUX2_RG1CR_SIG_ID_SHIFT		0
#define DMAMUX2_DMAMUX2_RG1CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux2_dmamux2_rg1cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_dmamux2_rg2cr DMAMUX2RG2CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX2_DMAMUX2_RG2CR_GNBREQ_SHIFT		19
#define DMAMUX2_DMAMUX2_RG2CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux2_dmamux2_rg2cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX2_DMAMUX2_RG2CR_GPOL_SHIFT		17
#define DMAMUX2_DMAMUX2_RG2CR_GPOL_MASK		0x03
/** @defgroup dmamux2_dmamux2_rg2cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX2_DMAMUX2_RG2CR_GE DMA request generator channel enable/disable **/
#define DMAMUX2_DMAMUX2_RG2CR_GE		(1 << 16)
/** DMAMUX2_DMAMUX2_RG2CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX2_DMAMUX2_RG2CR_OIE		(1 << 8)

#define DMAMUX2_DMAMUX2_RG2CR_SIG_ID_SHIFT		0
#define DMAMUX2_DMAMUX2_RG2CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux2_dmamux2_rg2cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_dmamux2_rg3cr DMAMUX2RG3CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX2_DMAMUX2_RG3CR_GNBREQ_SHIFT		19
#define DMAMUX2_DMAMUX2_RG3CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux2_dmamux2_rg3cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


